// interface IQualifResults {
//   id: number;
//   lastName: string;
//   firstName: string;
//   middleName: string;
//   region: string;
//   grade: number | string;
//   score: number;
//   status?: string;
//   details?: string;
// }

interface IRankings {
  id: number;
  lastName: string;
  firstName: string;
  middleName: string;
  region: string;
  grade: number | string;
  score: number;
  status:
    | "Победитель"
    | "Призер II степени"
    | "Призер III степени"
    | "Участник";
  details: string;
}

export const rankings2023: IRankings[] = [
  {
    id: 231,
    lastName: "Мурзин",
    firstName: "Дмитрий",
    middleName: "Константинович",
    region: "Санкт-Петербург",
    grade: 11,
    score: 463,
    status: "Победитель",
    details:
      "https://mvd.ru/upload/site116/folder_page/047/644/342/Murzin_D.K.pdf",
  },
  {
    id: 1001,
    lastName: "Пахневский",
    firstName: "Гордей",
    middleName: "Михайлович",
    region: "Новосибирская область",
    grade: 2,
    score: 423,
    status: "Призер II степени",
    details:
      "https://mvd.ru/upload/site116/folder_page/047/644/342/Pakhnevskiy_G.M.pdf",
  },
  {
    id: 228,
    lastName: "Чечеткин",
    firstName: "Алексей",
    middleName: "Викторович",
    grade: "11 класс",
    region: "Санкт-Петербург",
    score: 416,
    status: "Призер II степени",
    details:
      "https://mvd.ru/upload/site116/folder_page/047/644/342/Chechetkin_A.V.pdf",
  },
  {
    id: 90,
    lastName: "Зайцева",
    firstName: "Снежана",
    middleName: "Александровна",
    grade: "11 класс",
    region: "Кемеровская область",
    score: 414,
    status: "Призер III степени",
    details:
      "https://mvd.ru/upload/site116/folder_page/047/644/342/Zaytseva_S.A.pdf",
  },
  {
    id: 519,
    lastName: "Черкасов",
    firstName: "Артём",
    middleName: "Александрович",
    grade: "11 класс",
    region: "Астраханская область",
    score: 411,
    status: "Призер III степени",
    details:
      "https://mvd.ru/upload/site116/folder_page/047/644/342/Cherkasov_A.A.pdf",
  },
];

// Список регионов России
export const regions = [
  "Республика Адыгея (Адыгея)",
  "Республика Алтай",
  "Республика Башкортостан",
  "Республика Бурятия",
  "Республика Дагестан",
  "Донецкая Народная Республика",
  "Республика Ингушетия",
  "Кабардино-Балкарская Республика",
  "Республика Калмыкия",
  "Карачаево-Черкесская Республика",
  "Республика Карелия",
  "Республика Коми",
  "Республика Крым",
  "Луганская Народная Республика",
  "Республика Марий Эл",
  "Республика Мордовия",
  "Республика Саха (Якутия)",
  "Республика Северная Осетия - Алания",
  "Республика Татарстан (Татарстан)",
  "Республика Тыва",
  "Удмуртская Республика",
  "Республика Хакасия",
  "Чеченская Республика",
  "Чувашская Республика - Чувашия",
  "Алтайский край",
  "Забайкальский край",
  "Камчатский край",
  "Краснодарский край",
  "Красноярский край",
  "Пермский край",
  "Приморский край",
  "Ставропольский край",
  "Хабаровский край",
  "Амурская область",
  "Архангельская область",
  "Астраханская область",
  "Белгородская область",
  "Брянская область",
  "Владимирская область",
  "Волгоградская область",
  "Вологодская область",
  "Воронежская область",
  "Запорожская область",
  "Ивановская область",
  "Иркутская область",
  "Калининградская область",
  "Калужская область",
  "Кемеровская область - Кузбасс",
  "Кировская область",
  "Костромская область",
  "Курганская область",
  "Курская область",
  "Ленинградская область",
  "Липецкая область",
  "Магаданская область",
  "Московская область",
  "Мурманская область",
  "Нижегородская область",
  "Новгородская область",
  "Новосибирская область",
  "Омская область",
  "Оренбургская область",
  "Орловская область",
  "Пензенская область",
  "Псковская область",
  "Ростовская область",
  "Рязанская область",
  "Самарская область",
  "Саратовская область",
  "Сахалинская область",
  "Свердловская область",
  "Смоленская область",
  "Тамбовская область",
  "Тверская область",
  "Томская область",
  "Тульская область",
  "Тюменская область",
  "Ульяновская область",
  "Херсонская область",
  "Челябинская область",
  "Ярославская область",
  "Москва",
  "Санкт-Петербург",
  "Севастополь",
  "Еврейская автономная область",
  "Ненецкий автономный округ",
  "Ханты-Мансийский автономный округ - Югра",
  "Чукотский автономный округ",
  "Ямало-Ненецкий автономный округ",
];
